app/controllers/bookmarks_controller.rb

DELETE FROM `bookmarks` WHERE `bookmarks`.`id` = ?  [["id", 1]]
---
  def clear
    if current_or_guest_user.bookmarks.clear